app/controllers/tweets_controller.rb

    def index
    tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
        tweet = Tweet.new(tweet_params)
        if tweet.save
---
INSERT INTO "tweets" ("title", "content", "author") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Concession!!!"], ["content", "The president must concede in a timely manner.... and he will"], ["author", "People"]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tweets" SET "title" = $1, "content" = $2, "author" = $3 WHERE "tweets"."id" = $4  [["title", "Timely Concession!!!"], ["content", "The president must concede in a timely manner.... and he will"], ["author", "People"], ["id", 2]]

    def destroy
        tweet = Tweet.destroy(params[:id])
---
DELETE FROM "tweets" WHERE "tweets"."id" = $1  [["id", 4]]